[M_AmuletDoNothing MissionDefinition]
MissionName="Omelet"
MissionDescription="A mysterious businessman named Brazo Pirzo gives them a clue. He doesn't tell you what to do, but he does say that if he could use any of his kits to stop the magical army, he would choose the amulet. You might make him forget or punch him in the face."
TurnInDescription="You are about to make a wise choice."
MissionSummary="Should you buy Secrets of the Pyrozzo Witch…."
MissionGiver="Economy of Perugia"
MissionTurnInLocation="Pirui is magic"
TeaserText="There has to be a decision.."

[M_AmuletDoNothing:AmuletDoesNothing_OS_BuyAmulet MissionObjectiveSetBranchingDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_AmuletDoNothing:AquireAmulet MissionObjectiveDefinition]
ProgressMessage="Buy minion toys"

[M_AmuletDoNothing:BuyAmulet MissionObjectiveDefinition]
ProgressMessage="Nice purchase"

[M_AmuletDoNothing:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_AmuletDoNothing:PunchMiz MissionObjectiveDefinition]
ProgressMessage="Pieroho punched him in the face."

